# Logistics-
毕业论文软件设计系统实现
本课题的是开发出一个物流管理系统，提供职工管理，客户管理，车辆管理，平台内信息搜索，运单管理，后台管理员对基础数据，仓库信息等的管理。该系统还提供一个开放的客户查询物流的接口，客户只需要输入正确的单号，即可查看相应的物流信息。
功能模块概要：
系统用户：普通职工，后台管理员，业务经理。根据各类用户的只能，分配不同的权限，不同权限只能访问相应的功能或页面。用户的注册不开放，仅通过后台管理员的录入后，职工自行登录并修改个人信息或密码。
客户管理：此功能为录入客户的信息并登记客户的反馈情况，此功能只能由相应权限的用户才能进行操作。
车辆管理。对车辆的信息和状态进行登记，并在车辆的状态改变时及时更新其状态。记录当前车辆的位置。
仓库管理：对仓库容量变化的更新。
运单管理：接收到订单时，录入基础信息，并且分发订单的任务。到达目的地时，更新运单状态，位置。
数据字典：对系统内常用的变量名称进行规范化，便于开发与维护。
公司信息：对使用本系统的子公司，进行录入并管理。
菜单管理：系统的导航菜单，只有管理员才可更改。点击时可打开相应的功能页面，右击可设置菜单属性。
权限管理：
运单查询：提供个客户查询的接口，根据单号查看相应的物流信息。
